let sections = [
    {
        "name": "அறத்துப்பால்",
        "start": 1,
        "end": 380
    },
    {
        "name": "பொருட்பால்",
        "start": 381,
        "end": 1080
    },
    {
        "name": "காமத்துப்பால்",
        "start": 1081,
        "end": 1330
    }
],

chapters = [
    {
        "name": "பாயிரவியல்",
        "start": 1,
        "end": 40
    },
    {
        "name": "இல்லறவியல்",
        "start": 41,
        "end": 240
    },
    {
        "name": "துறவறவியல்",
        "start": 241,
        "end": 370
    },
    {
        "name": "ஊழியல்",
        "start": 371,
        "end": 380
    },
    {
        "name": "அரசியல்",
        "start": 381,
        "end": 630
    },
    {
        "name": "அமைச்சியல்",
        "start": 631,
        "end": 730
    },
    {
        "name": "அரணியல்",
        "start": 731,
        "end": 750
    },
    {
        "name": "கூழியல்",
        "start": 751,
        "end": 760
    },
    {
        "name": "படையில்",
        "start": 761,
        "end": 780
    },
    {
        "name": "நட்பியல்",
        "start": 781,
        "end": 950
    },
    {
        "name": "குடியியல்",
        "start": 951,
        "end": 1080
    },
    {
        "name": "களவியல்",
        "start": 1081,
        "end": 1160
    },
    {
        "name": "கற்பியல்",
        "start": 1161,
        "end": 1330
    }
],

subChapters = [
    {
        "name": "கடவுள் வாழ்த்து",
        "start": 1,
        "end": 10
    },
    {
        "name": "வான்சிறப்பு",
        "start": 11,
        "end": 20
    },
    {
        "name": "நீத்தார் பெருமை",
        "start": 21,
        "end": 30
    },
    {
        "name": "அறன் வலியுறுத்தல்",
        "start": 31,
        "end": 40
    },
    {
        "name": "இல்வாழ்க்கை",
        "start": 41,
        "end": 50
    },
    {
        "name": "வாழ்க்கைத் துணைநலம்",
        "start": 51,
        "end": 60
    },
    {
        "name": "மக்கட்பேறு",
        "start": 61,
        "end": 70
    },
    {
        "name": "அன்புடைமை",
        "start": 71,
        "end": 80
    },
    {
        "name": "விருந்தோம்பல்",
        "start": 81,
        "end": 90
    },
    {
        "name": "இனியவை கூறல்",
        "start": 91,
        "end": 100
    },
    {
        "name": "செய்ந்நன்றியறிதல்",
        "start": 101,
        "end": 110
    },
    {
        "name": "நடுவு நிலைமை",
        "start": 111,
        "end": 120
    },
    {
        "name": "அடக்கம் உடைமை",
        "start": 121,
        "end": 130
    },
    {
        "name": "ஒழுக்கம் உடைமை",
        "start": 131,
        "end": 140
    },
    {
        "name": "பிறனில் விழையாமை",
        "start": 141,
        "end": 150
    },
    {
        "name": "பொறையுடைமை",
        "start": 151,
        "end": 160
    },
    {
        "name": "அழுக்காறாமை",
        "start": 161,
        "end": 170
    },
    {
        "name": "வெஃகாமை",
        "start": 171,
        "end": 180
    },
    {
        "name": "புறங்கூறாமை",
        "start": 181,
        "end": 190
    },
    {
        "name": "பயனில சொல்லாமை",
        "start": 191,
        "end": 200
    },
    {
        "name": "தீவினையச்சம்",
        "start": 201,
        "end": 210
    },
    {
        "name": "ஒப்புரவறிதல்",
        "start": 211,
        "end": 220
    },
    {
        "name": "ஈகை",
        "start": 221,
        "end": 230
    },
    {
        "name": "புகழ்",
        "start": 231,
        "end": 240
    },
    {
        "name": "அருளுடைமை",
        "start": 241,
        "end": 250
    },
    {
        "name": "புலால் மறுத்தல்",
        "start": 251,
        "end": 260
    },
    {
        "name": "தவம்",
        "start": 261,
        "end": 270
    },
    {
        "name": "கூடா ஒழுக்கம்",
        "start": 271,
        "end": 280
    },
    {
        "name": "கள்ளாமை",
        "start": 281,
        "end": 290
    },
    {
        "name": "வாய்மை",
        "start": 291,
        "end": 300
    },
    {
        "name": "வெகுளாமை",
        "start": 301,
        "end": 310
    },
    {
        "name": "இன்னா செய்யாமை",
        "start": 311,
        "end": 320
    },
    {
        "name": "கொல்லாமை",
        "start": 321,
        "end": 330
    },
    {
        "name": "நிலையாமை",
        "start": 331,
        "end": 340
    },
    {
        "name": "துறவு",
        "start": 341,
        "end": 350
    },
    {
        "name": "மெய்யுணர்தல்",
        "start": 351,
        "end": 360
    },
    {
        "name": "அவா அறுத்தல்",
        "start": 361,
        "end": 370
    },
    {
        "name": "ஊழ்",
        "start": 371,
        "end": 380
    },
    {
        "name": "இறைமாட்சி",
        "start": 381,
        "end": 390
    },
    {
        "name": "கல்வி",
        "start": 391,
        "end": 400
    },
    {
        "name": "கல்லாமை",
        "start": 401,
        "end": 410
    },
    {
        "name": "கேள்வி",
        "start": 411,
        "end": 420
    },
    {
        "name": "அறிவுடைமை",
        "start": 421,
        "end": 430
    },
    {
        "name": "குற்றங்கடிதல்",
        "start": 431,
        "end": 440
    },
    {
        "name": "பெரியாரைத் துணைக்கோடல்",
        "start": 441,
        "end": 450
    },
    {
        "name": "சிற்றினம் சேராமை",
        "start": 451,
        "end": 460
    },
    {
        "name": "தெரிந்து செயல்வகை",
        "start": 461,
        "end": 470
    },
    {
        "name": "வலியறிதல்",
        "start": 471,
        "end": 480
    },
    {
        "name": "காலமறிதல்",
        "start": 481,
        "end": 490
    },
    {
        "name": "இடனறிதல்",
        "start": 491,
        "end": 500
    },
    {
        "name": "தெரிந்து தெளிதல்",
        "start": 501,
        "end": 510
    },
    {
        "name": "தெரிந்து வினையாடல்",
        "start": 511,
        "end": 520
    },
    {
        "name": "சுற்றந் தழால்",
        "start": 521,
        "end": 530
    },
    {
        "name": "பொச்சாவாமை",
        "start": 531,
        "end": 540
    },
    {
        "name": "செங்கோன்மை",
        "start": 541,
        "end": 550
    },
    {
        "name": "கொடுங்கோன்மை",
        "start": 551,
        "end": 560
    },
    {
        "name": "வெருவந்த செய்யாமை",
        "start": 561,
        "end": 570
    },
    {
        "name": "கண்ணோட்டம்",
        "start": 571,
        "end": 580
    },
    {
        "name": "ஒற்றாடல்",
        "start": 581,
        "end": 590
    },
    {
        "name": "ஊக்கம் உடைமை",
        "start": 591,
        "end": 600
    },
    {
        "name": "மடி இன்மை",
        "start": 601,
        "end": 610
    },
    {
        "name": "ஆள்வினை உடைமை",
        "start": 611,
        "end": 620
    },
    {
        "name": "இடுக்கண் அழியாமை",
        "start": 621,
        "end": 630
    },
    {
        "name": "அமைச்சு",
        "start": 631,
        "end": 640
    },
    {
        "name": "சொல்வன்மை",
        "start": 641,
        "end": 650
    },
    {
        "name": "வினைத் தூய்மை",
        "start": 651,
        "end": 660
    },
    {
        "name": "வினைத்திட்பம்",
        "start": 661,
        "end": 670
    },
    {
        "name": "வினை செயல்வகை",
        "start": 671,
        "end": 680
    },
    {
        "name": "தூது",
        "start": 681,
        "end": 690
    },
    {
        "name": "மன்னரைச் சேர்ந்து ஒழுகல்",
        "start": 691,
        "end": 700
    },
    {
        "name": "குறிப்பறிதல்",
        "start": 701,
        "end": 710
    },
    {
        "name": "அவை அறிதல்",
        "start": 711,
        "end": 720
    },
    {
        "name": "அவை அஞ்சாமை",
        "start": 721,
        "end": 730
    },
    {
        "name": "நாடு",
        "start": 731,
        "end": 740
    },
    {
        "name": "அரண்",
        "start": 741,
        "end": 750
    },
    {
        "name": "பொருள் செயல்வகை",
        "start": 751,
        "end": 760
    },
    {
        "name": "படை மாட்சி",
        "start": 761,
        "end": 770
    },
    {
        "name": "படைச் செருக்கு",
        "start": 771,
        "end": 780
    },
    {
        "name": "நட்பு",
        "start": 781,
        "end": 790
    },
    {
        "name": "நட்பாராய்தல்",
        "start": 791,
        "end": 800
    },
    {
        "name": "பழைமை",
        "start": 801,
        "end": 810
    },
    {
        "name": "தீ நட்பு",
        "start": 811,
        "end": 820
    },
    {
        "name": "கூடா நட்பு",
        "start": 821,
        "end": 830
    },
    {
        "name": "பேதைமை",
        "start": 831,
        "end": 840
    },
    {
        "name": "புல்லறிவாண்மை",
        "start": 841,
        "end": 850
    },
    {
        "name": "இகல்",
        "start": 851,
        "end": 860
    },
    {
        "name": "பகை மாட்சி",
        "start": 861,
        "end": 870
    },
    {
        "name": "பகைத்திறம் தெரிதல்",
        "start": 871,
        "end": 880
    },
    {
        "name": "உட்பகை",
        "start": 881,
        "end": 890
    },
    {
        "name": "பெரியாரைப் பிழையாமை",
        "start": 891,
        "end": 900
    },
    {
        "name": "பெண்வழிச் சேறல்",
        "start": 901,
        "end": 910
    },
    {
        "name": "வரைவின் மகளிர்",
        "start": 911,
        "end": 920
    },
    {
        "name": "கள்ளுண்ணாமை",
        "start": 921,
        "end": 930
    },
    {
        "name": "சூது",
        "start": 931,
        "end": 940
    },
    {
        "name": "மருந்து",
        "start": 941,
        "end": 950
    },
    {
        "name": "குடிமை",
        "start": 951,
        "end": 960
    },
    {
        "name": "மானம்",
        "start": 961,
        "end": 970
    },
    {
        "name": "பெருமை",
        "start": 971,
        "end": 980
    },
    {
        "name": "சான்றாண்மை",
        "start": 981,
        "end": 990
    },
    {
        "name": "பண்புடைமை",
        "start": 991,
        "end": 1000
    },
    {
        "name": "நன்றியில் செல்வம்",
        "start": 1001,
        "end": 1010
    },
    {
        "name": "நாணுடைமை",
        "start": 1011,
        "end": 1020
    },
    {
        "name": "குடிசெயல் வகை",
        "start": 1021,
        "end": 1030
    },
    {
        "name": "உழவு",
        "start": 1031,
        "end": 1040
    },
    {
        "name": "நல்குரவு",
        "start": 1041,
        "end": 1050
    },
    {
        "name": "இரவு",
        "start": 1051,
        "end": 1060
    },
    {
        "name": "இரவச்சம்",
        "start": 1061,
        "end": 1070
    },
    {
        "name": "கயமை",
        "start": 1071,
        "end": 1080
    },
    {
        "name": "தகை அணங்குறுத்தல்",
        "start": 1081,
        "end": 1090
    },
    {
        "name": "குறிப்பறிதல்",
        "start": 1091,
        "end": 1100
    },
    {
        "name": "புணர்ச்சி மகிழ்தல்",
        "start": 1101,
        "end": 1110
    },
    {
        "name": "நலம் புனைந்து உரைத்தல்",
        "start": 1111,
        "end": 1120
    },
    {
        "name": "காதற் சிறப்புரைத்தல்",
        "start": 1121,
        "end": 1130
    },
    {
        "name": "நாணுத் துறவுரைத்தல்",
        "start": 1131,
        "end": 1140
    },
    {
        "name": "அலர் அறிவுறுத்தல்",
        "start": 1141,
        "end": 1150
    },
    {
        "name": "பிரிவு ஆற்றாமை",
        "start": 1151,
        "end": 1160
    },
    {
        "name": "படர்மெலிந் திரங்கல்",
        "start": 1161,
        "end": 1170
    },
    {
        "name": "கண் விதுப்பழிதல்",
        "start": 1171,
        "end": 1180
    },
    {
        "name": "பசப்புறு பருவரல்",
        "start": 1181,
        "end": 1190
    },
    {
        "name": "தனிப்படர் மிகுதி",
        "start": 1191,
        "end": 1200
    },
    {
        "name": "நினைந்தவர் புலம்பல்",
        "start": 1201,
        "end": 1210
    },
    {
        "name": "கனவுநிலை உரைத்தல்",
        "start": 1211,
        "end": 1220
    },
    {
        "name": "பொழுதுகண்டு இரங்கல்",
        "start": 1221,
        "end": 1230
    },
    {
        "name": "உறுப்புநலன் அழிதல்",
        "start": 1231,
        "end": 1240
    },
    {
        "name": "நெஞ்சொடு கிளத்தல்",
        "start": 1241,
        "end": 1250
    },
    {
        "name": "நிறையழிதல்",
        "start": 1251,
        "end": 1260
    },
    {
        "name": "அவர்வயின் விதும்பல்",
        "start": 1261,
        "end": 1270
    },
    {
        "name": "குறிப்பறிவுறுத்தல்",
        "start": 1271,
        "end": 1280
    },
    {
        "name": "புணர்ச்சி விதும்பல்",
        "start": 1281,
        "end": 1290
    },
    {
        "name": "நெஞ்சொடு புலத்தல்",
        "start": 1291,
        "end": 1300
    },
    {
        "name": "புலவி",
        "start": 1301,
        "end": 1310
    },
    {
        "name": "புலவி நுணுக்கம்",
        "start": 1311,
        "end": 1320
    },
    {
        "name": "ஊடலுவகை",
        "start": 1321,
        "end": 1330
    }
]